1.Problem: Create a Pandas DataFrame from a dictionary of lists and print it.

In [1]:
import pandas as pd

In [31]:
data = {'Name': ['Shree', 'Ram', 'Charlie','Sai', 'Shivani'],
        'Age': [25, 30, 22, 45, 32],
        'City': ['Karad', 'Sangli', 'Satara', 'Mumbai', "Pune"]}

df = pd.DataFrame(data)
df

      Name  Age    City
0    Shree   25   Karad
1      Ram   30  Sangli
2  Charlie   22  Satara
3      Sai   45  Mumbai
4  Shivani   32    Pune

2.Problem: Create a Pandas DataFrame from a list of dictionaries and print it.

In [16]:
data_list = [
    {'Name': 'Shree', 'Age': 25, 'City': 'Karad'},
    {'Name': 'Ram', 'Age': 30, 'City': 'Sangli'},
    {'Name': 'Charlie', 'Age': 22, 'City': 'Satara'},
    {}
]

df = pd.DataFrame(data_list)
df

      Name  Age      City
0    Shree   25  New York
1      Ram   30       USA
2  Charlie   22     India

3.Problem: Given a DataFrame, print the first 5 rows.

In [17]:
from numpy.random import randn

In [18]:
df1 = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='1 2 3 4'.split())
df1.head()

          1         2         3         4
A -1.457482 -0.326791  1.167073 -0.094076
B -1.422119  0.479040 -0.437751 -2.267437
C  0.828512 -0.926738 -0.068851 -0.526026
D -0.443966  0.289312  2.059228  1.281478
E  0.267710  0.916537 -0.174402  0.474091

4.Problem: Given a DataFrame, print the value at the intersection of row 2 and column 'Age'.

In [19]:
df

      Name  Age      City
0    Shree   25  New York
1      Ram   30       USA
2  Charlie   22     India

In [28]:
import pandas as pd

df.loc[2, 'Age']

22

5.Problem: Given a DataFrame, filter the rows where the 'Age' column is greater than 30.

In [30]:
df[df['Age'] > 30]

Empty DataFrame
Columns: [Name, Age, City]
Index: []